// Написать программу вычисления значения функции y = f(a)
// y=2a+1
int argA = new Random().Next(1,10);
Console.WriteLine(argA);

Console.WriteLine("y = 2a+1 = {0}", 2*argA + 1);